# GetRibbonPanels Method (String) (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
UIApplication..::..GetRibbonPanels Method (String)
UIApplication Class See Also
---
Get all the custom Panels on a designated Revit tab.
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual List<RibbonPanel> GetRibbonPanels(
	string tabName
)
```

Visual Basic
---
```text
Public Overridable Function GetRibbonPanels ( _
	tabName As String _
) As List(Of RibbonPanel)
```

Visual C++
---
```text
public:
virtual List<RibbonPanel^>^ GetRibbonPanels(
	String^ tabName
)
```

# ### Parameters
tabName
    Type: System..::..StringThe name of the tab on which the panels are located.
# Remarks
Built-in panels will not be included. tabName must be the name of one of the tabs added by CreateRibbonTab(String). This method is not supported in Macros.
# See Also
UIApplication Class
GetRibbonPanels Overload
Autodesk.Revit.UI Namespace